backend/app/controllers/api/v1/sessions_controller.rb

  def create
    credentials = params[:user] || params
    user = User.find_for_database_authentication(email: credentials[:email].to_s.strip)

    unless user&.valid_password?(credentials[:password].to_s)
      return render json: { error: "Invalid email or password" }, status: :unauthorized
    end

    now = Time.current
    expires_at = now + Api::V1::JwtToken::LIFETIME
    token = nil
    user.with_lock do
      user.authentications.create!(
        authentication_token: SecureRandom.hex(32),
        last_login_at: now,
        authentication_expires_at: expires_at,
        status: true
      ).tap do |authentication|
        token = Api::V1::JwtToken.encode(user: user, authentication: authentication, issued_at: now)
        authentication.update!(authentication_token: Digest::SHA256.hexdigest(token))
---
SELECT "users".* FROM "users" WHERE "users"."email" = 'aditi.kapoor@salarymanagement.test' ORDER BY "users"."id" ASC LIMIT 1
INSERT INTO "authentications" ("user_id", "authentication_token", "last_login_at", "authentication_expires_at", "status", "created_at", "updated_at") VALUES (12, 'c3882c78878bdd933fac406675bbc38d7b69d702ddf892b1ce10c7280551c6ce', '2026-10-09 16:08:05.319262', '2026-10-10 16:08:05.319262', TRUE, '2026-10-09 16:08:05.344153', '2026-10-09 16:08:05.344153') RETURNING "id"
UPDATE "authentications" SET "authentication_token" = 'ebb2340e1dd0a8ed0ae5e27e3ec48f3b64a8ceb4cca62f04806a87fe0dae352b', "updated_at" = '2026-10-09 16:31:21.636740' WHERE "authentications"."id" = 5